---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.HideReforWorkPlanes
source: html/a9a59188-02a7-51ea-754e-fafbd719272f.htm
---
# Autodesk.Revit.DB.PrintParameters.HideReforWorkPlanes Property

Indicates whether to hide reference/work planes when printing.

## Syntax (C#)
```csharp
public bool HideReforWorkPlanes { get; set; }
```